add updates to cache
