--- a/documents/TIPs/cache_proposal_23_jan.md
+++ b/documents/TIPs/cache_proposal_23_jan.md
@@ -22,32 +22,82 @@ The current cache is changed so that instead of holding `Pubkey[TagionBill]` it 
 
 # Performing a `hirpc.trt`
-
-```plantuml 
-@startuml
-
-actor User
-
-box "Shell" #LightBlue
-  participant "/api/dart" as API
-  box "Cache" #Red
-    participant "TRT Cache" as TrtCache
-    participant "DART archive cache" as DARTCache
-  end box
-end box
-
-box "Kernel" #LightGreen
-  participant "TRT" as TRT
-  participant "DART" as DART
-end box
-
-
-User -> API: Send HiRPC.trt request
-API -> TrtCache: Lookup pubkeys in cache
-TrtCache -> TRT: Pubkeys not found in cache are requested
-TRT -> TrtCache: DARTIndices returned
-TRTCache -> API
-API -> User: User retrieved list of DARTIndices
-
-@enduml
+```mermaid
+sequenceDiagram
+  participant User as User
+  participant API as "/api/dart"
+  
+  activate User
+  User ->> API: Send hirpc.trt request
+  API ->> TrtCache: Lookup pubkeys in cache
+  deactivate User
+  
+  activate TrtCache
+  TrtCache ->> TRT: Pubkeys not found in cache are requested
+  TRT ->> TrtCache: DARTIndices returned
+  TrtCache ->> TrtCache: Update cache and bundle response
+  TrtCache ->> API: Return hirpc.result with DARTIndices
+  deactivate TrtCache
+  
+  activate API
+  API -->> User: User retrieved list of DARTIndices
+  deactivate API
 ```
+
+# Performing a dartRead
+```mermaid
